Ran Plan for 5 projects:

1. dir: `atlantis-deploy` workspace: `default`
1. dir: `terraform-provisioning/terraform/ecr/gyanni/ap-northeast-2` workspace: `default`
1. dir: `terraform-provisioning/terraform/ecr/gyanni` workspace: `default`
1. dir: `terraform-provisioning/terraform/init/tfplayground` workspace: `default`
1. dir: `terraform-provisioning/terraform/variables` workspace: `default`

### 1. dir: `atlantis-deploy` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/usr/local/bin/terraform init -input=false -no-color -upgrade" in "/home/atlantis/.atlantis/repos/Gyanni/terraform-playground/1/default/atlantis-deploy": exit status 1
Upgrading modules...
Downloading terraform-aws-modules/alb/aws 9.11.0 for alb...
- alb in .terraform/modules/alb
Downloading terraform-aws-modules/security-group/aws 5.1.2 for alb_http_sg...
- alb_http_sg in .terraform/modules/alb_http_sg/modules/http-80
- alb_http_sg.sg in .terraform/modules/alb_http_sg
Downloading terraform-aws-modules/security-group/aws 5.1.2 for atlantis_sg...
- atlantis_sg in .terraform/modules/atlantis_sg
Downloading cloudposse/ecs-container-definition/aws 0.61.1 for container_definition_bitbucket...
- container_definition_bitbucket in .terraform/modules/container_definition_bitbucket
Downloading cloudposse/ecs-container-definition/aws 0.61.1 for container_definition_github_gitlab...
- container_definition_github_gitlab in .terraform/modules/container_definition_github_gitlab
Downloading terraform-aws-modules/ecs/aws 5.11.4 for ecs...
- ecs in .terraform/modules/ecs
- ecs.cluster in .terraform/modules/ecs/modules/cluster
- ecs.service in .terraform/modules/ecs/modules/service
- ecs.service.container_definition in .terraform/modules/ecs/modules/container-definition
Downloading terraform-aws-modules/vpc/aws 5.12.1 for vpc...
- vpc in .terraform/modules/vpc
There are some problems with the configuration, described below.

The Terraform configuration must be valid before initialization so that
Terraform can determine which modules and providers need to be installed.

Error: Optional object type attributes are experimental

  on .terraform/modules/container_definition_bitbucket/variables.tf line 24:
  24: variable "container_definition" {

This feature is currently an opt-in experiment, subject to change in future
releases based on feedback.

Activate the feature for this module by adding module_variable_optional_attrs
to the list of active experiments.


Error: Optional object type attributes are experimental

  on .terraform/modules/container_definition_bitbucket/variables.tf line 146:
 146: variable "port_mappings" {

This feature is currently an opt-in experiment, subject to change in future
releases based on feedback.

Activate the feature for this module by adding module_variable_optional_attrs
to the list of active experiments.


Error: Optional object type attributes are experimental

  on .terraform/modules/container_definition_bitbucket/variables.tf line 159:
 159: variable "healthcheck" {

This feature is currently an opt-in experiment, subject to change in future
releases based on feedback.

Activate the feature for this module by adding module_variable_optional_attrs
to the list of active experiments.


Error: Optional object type attributes are experimental

  on .terraform/modules/container_definition_bitbucket/variables.tf line 259:
 259: variable "linux_parameters" {

This feature is currently an opt-in experiment, subject to change in future
releases based on feedback.

Activate the feature for this module by adding module_variable_optional_attrs
to the list of active experiments.


Error: Optional object type attributes are experimental

  on .terraform/modules/container_definition_bitbucket/variables.tf line 285:
 285: variable "log_configuration" {

This feature is currently an opt-in experiment, subject to change in future
releases based on feedback.

Activate the feature for this module by adding module_variable_optional_attrs
to the list of active experiments.


Error: Optional object type attributes are experimental

  on .terraform/modules/container_definition_bitbucket/variables.tf line 299:
 299: variable "firelens_configuration" {

This feature is currently an opt-in experiment, subject to change in future
releases based on feedback.

Activate the feature for this module by adding module_variable_optional_attrs
to the list of active experiments.


Error: Optional object type attributes are experimental

  on .terraform/modules/container_definition_bitbucket/variables.tf line 309:
 309: variable "mount_points" {

This feature is currently an opt-in experiment, subject to change in future
releases based on feedback.

Activate the feature for this module by adding module_variable_optional_attrs
to the list of active experiments.


Error: Optional object type attributes are experimental

  on .terraform/modules/container_definition_bitbucket/variables.tf line 352:
 352: variable "volumes_from" {

This feature is currently an opt-in experiment, subject to change in future
releases based on feedback.

Activate the feature for this module by adding module_variable_optional_attrs
to the list of active experiments.


Error: Optional object type attributes are experimental

  on .terraform/modules/container_definition_github_gitlab/variables.tf line 24:
  24: variable "container_definition" {

This feature is currently an opt-in experiment, subject to change in future
releases based on feedback.

Activate the feature for this module by adding module_variable_optional_attrs
to the list of active experiments.


Error: Optional object type attributes are experimental

  on .terraform/modules/container_definition_github_gitlab/variables.tf line 146:
 146: variable "port_mappings" {

This feature is currently an opt-in experiment, subject to change in future
releases based on feedback.

Activate the feature for this module by adding module_variable_optional_attrs
to the list of active experiments.


Error: Optional object type attributes are experimental

  on .terraform/modules/container_definition_github_gitlab/variables.tf line 159:
 159: variable "healthcheck" {

This feature is currently an opt-in experiment, subject to change in future
releases based on feedback.

Activate the feature for this module by adding module_variable_optional_attrs
to the list of active experiments.


Error: Optional object type attributes are experimental

  on .terraform/modules/container_definition_github_gitlab/variables.tf line 259:
 259: variable "linux_parameters" {

This feature is currently an opt-in experiment, subject to change in future
releases based on feedback.

Activate the feature for this module by adding module_variable_optional_attrs
to the list of active experiments.


Error: Optional object type attributes are experimental

  on .terraform/modules/container_definition_github_gitlab/variables.tf line 285:
 285: variable "log_configuration" {

This feature is currently an opt-in experiment, subject to change in future
releases based on feedback.

Activate the feature for this module by adding module_variable_optional_attrs
to the list of active experiments.


Error: Optional object type attributes are experimental

  on .terraform/modules/container_definition_github_gitlab/variables.tf line 299:
 299: variable "firelens_configuration" {

This feature is currently an opt-in experiment, subject to change in future
releases based on feedback.

Activate the feature for this module by adding module_variable_optional_attrs
to the list of active experiments.


Error: Optional object type attributes are experimental

  on .terraform/modules/container_definition_github_gitlab/variables.tf line 309:
 309: variable "mount_points" {

This feature is currently an opt-in experiment, subject to change in future
releases based on feedback.

Activate the feature for this module by adding module_variable_optional_attrs
to the list of active experiments.


Error: Optional object type attributes are experimental

  on .terraform/modules/container_definition_github_gitlab/variables.tf line 352:
 352: variable "volumes_from" {

This feature is currently an opt-in experiment, subject to change in future
releases based on feedback.

Activate the feature for this module by adding module_variable_optional_attrs
to the list of active experiments.


```
</details>

---
### 2. dir: `terraform-provisioning/terraform/ecr/gyanni/ap-northeast-2` workspace: `default`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_ecr_repository.demoapp will be created
+ resource "aws_ecr_repository" "demoapp" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "demoapp"
      + region               = "ap-northeast-2"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.tfplayground will be created
+ resource "aws_ecr_repository" "tfplayground" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "tfplayground"
      + region               = "ap-northeast-2"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository_policy.demoapp will be created
+ resource "aws_ecr_repository_policy" "demoapp" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:DescribeRepositories",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:ListImages",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::289574460446:root",
                            ]
                        }
                    },
                ]
              + Version   = "2008-10-17"
            }
        )
      + region      = "ap-northeast-2"
      + registry_id = (known after apply)
      + repository  = "demoapp"
    }

  # aws_ecr_repository_policy.tfplayground will be created
+ resource "aws_ecr_repository_policy" "tfplayground" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:DescribeRepositories",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:ListImages",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::289574460446:root",
                            ]
                        }
                    },
                ]
              + Version   = "2008-10-17"
            }
        )
      + region      = "ap-northeast-2"
      + registry_id = (known after apply)
      + repository  = "tfplayground"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform-provisioning/terraform/ecr/gyanni/ap-northeast-2`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis-402650273.ap-northeast-2.elb.amazonaws.com/lock?id=Gyanni%252Fterraform-playground%252Fterraform-provisioning%252Fterraform%252Fecr%252Fgyanni%252Fap-northeast-2%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform-provisioning/terraform/ecr/gyanni/ap-northeast-2`
</details>
Plan: 4 to add, 0 to change, 0 to destroy.

---
### 3. dir: `terraform-provisioning/terraform/ecr/gyanni` workspace: `default`
```diff

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform-provisioning/terraform/ecr/gyanni`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis-402650273.ap-northeast-2.elb.amazonaws.com/lock?id=Gyanni%252Fterraform-playground%252Fterraform-provisioning%252Fterraform%252Fecr%252Fgyanni%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform-provisioning/terraform/ecr/gyanni`

---
### 4. dir: `terraform-provisioning/terraform/init/tfplayground` workspace: `default`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_dynamodb_table.terraform_state_lock_table will be created
+ resource "aws_dynamodb_table" "terraform_state_lock_table" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = "terraform-lock-table"
      + read_capacity    = (known after apply)
      + region           = "ap-northeast-2"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockID"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = (known after apply)
          + name               = (known after apply)
          + non_key_attributes = (known after apply)
          + projection_type    = (known after apply)
          + range_key          = (known after apply)
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)

          + key_schema {
              + attribute_name = (known after apply)
              + key_type       = (known after apply)
            }

          + on_demand_throughput {
              + max_read_request_units  = (known after apply)
              + max_write_request_units = (known after apply)
            }

          + warm_throughput {
              + read_units_per_second  = (known after apply)
              + write_units_per_second = (known after apply)
            }
        }

      + global_table_witness {
          + region_name = (known after apply)
        }

      + point_in_time_recovery {
          + enabled                 = (known after apply)
          + recovery_period_in_days = (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }

      + ttl {
          + attribute_name = (known after apply)
          + enabled        = (known after apply)
        }

      + warm_throughput {
          + read_units_per_second  = (known after apply)
          + write_units_per_second = (known after apply)
        }
    }

  # aws_s3_bucket.tfstate will be created
+ resource "aws_s3_bucket" "tfstate" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "tfplayground-apnortheast2-tfstate"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-northeast-2"
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # aws_s3_bucket_versioning.versioning will be created
+ resource "aws_s3_bucket_versioning" "versioning" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "ap-northeast-2"

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform-provisioning/terraform/init/tfplayground`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis-402650273.ap-northeast-2.elb.amazonaws.com/lock?id=Gyanni%252Fterraform-playground%252Fterraform-provisioning%252Fterraform%252Finit%252Ftfplayground%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform-provisioning/terraform/init/tfplayground`
</details>
Plan: 3 to add, 0 to change, 0 to destroy.

---
### 5. dir: `terraform-provisioning/terraform/variables` workspace: `default`
```diff

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform-provisioning/terraform/variables`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis-402650273.ap-northeast-2.elb.amazonaws.com/lock?id=Gyanni%252Fterraform-playground%252Fterraform-provisioning%252Fterraform%252Fvariables%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform-provisioning/terraform/variables`

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
